test/performance-test/artillery/config.yaml
config:
  target: "localhost:8081"
  phases:
  - duration: 60
    arrivalCount: 10
  processor: "../sign-transaction.js"
  environments:
    localhost:
      target: "http://localhost:8081"
      phases:
      - duration: 120
        #arrivalRate: 60
        arrivalCount: 180
    testnet:
      target: "https://explorer.cardano-testnet.iohkdev.io/rosetta"
      phases:
      - duration: 120
        arrivalRate: 120
  payload:
    path: "../vars/{{  $environment  }}-vars.csv"
    fields:
    - "networkId"
    - "blockIndex"
    - "blockHash"
    - "transactionId"